Revit 2027 API
ScheduleDefinition.AddField Method
Overload List
Name | Description
AddField(SchedulableField) |  Adds a regular field at the end of the list.
AddField(ScheduleFieldType) |  Adds a regular field at the end of the list.
AddField(ScheduleFieldType, ElementId) |  Adds a regular field at the end of the list.
Top
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace